# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

print('введите любое целое  число: ')
a = int(input())
summ = 0
while a > 0:
    x = a % 10
    summ = summ + x
    a = a // 10
print(f'сумма трехзначнего числа = {summ}')

